Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་སྐྱོང་བ་ཁྱེད་ཅག་རྣམས་ཀྱིས་ནི། །བརྩོན་འགྲུས་རབ་ཏུ་བརྟན་པས་བསྐྱང་བར་བྱ། །འདི་ལྟར་མདོ་སྡེ་དཀོན་མཆོག་ཟབ་མོ་འདི། །སེམས་ཅན་ཀུན་ལ་བདེ་བ་སྦྱིན་བྱེད་པ། །སེམས་ཅན་རྣམས་ལ་ཕན་དང་བདེ་བའི་ཕྱིར། །
en: The Bhagavat then spoke these verses to the Four Mahārājas: “You who are guardians of the world Should protect with unwavering diligence The Golden Light, The Supreme King and Lord of Sūtras of those with the ten strengths, “So that this profound, precious sūtra That bestows happiness on all beings Will remain long in this Jambudvīpa For the sake of the happiness and benefit of beings.

source: འཛམ་བུའི་གླིང་འདིར་ཡུན་རིང་གནས་པར་འགྱུར། །འདི་ལྟར་སྟོང་གསུམ་གྱི་ནི་སྟོང་ཆེན་གྱི། །འཇིག་རྟེན་དག་ན་ངན་སོང་སྡུག་བསྔལ་དང་། །སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ནི། །སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་བྱེད་པ་ཡིན། །
en: “It will bring an end to all the suffering Of the beings that are in the hells And the suffering of the lower existences In the worlds of this trichiliocosm.

source: འཛམ་གླིང་འདི་ན་འཛམ་གླིང་གནས་པ་ཡི། །རྒྱལ་པོ་གང་དག་ཡིན་པ་ཐམས་ཅད་ཀྱིས། །རབ་ཏུ་དགའ་བ་ཆེན་པོ་བསྐྱེད་ནས་ནི། །ཆོས་རྣམས་ཀྱིས་ནི་ཡུལ་དག་བསྐྱང་བར་གྱིས། །
en: “Within this Jambudvīpa, May all the kings in Jambudvīpa With great, perfect joy Protect their domains through the Dharma.

source: གང་གིས་འཛམ་བུའི་གླིང་འདི་བདེ་བ་དང་། །ཤིན་ཏུ་ལོ་ལེགས་ཉམས་ཀྱང་དགར་འགྱུར་ཞིང་། །འཛམ་བུའི་གླིང་ནི་ཐམས་ཅད་དག་ན་ཡང་། །སེམས་ཅན་ཐམས་ཅད་བདེ་བར་འགྱུར་བར་གྱིས། །
en: “May those who make Jambudvīpa happy With excellent harvests and joy Make all beings become happy Throughout the whole of Jambudvīpa.

source: འདི་ན་མི་ཡི་དབང་པོ་གང་རྣམས་ནི། །ཡུལ་ལ་དགའ་དང་བདག་བདེ་དགའ་བ་དང་། །རྒྱལ་སྲིད་རྣམ་པར་འབྱོར་པ་དགའ་བ་དེས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་མཉན་པར་བྱ། །
en: “Those who are lords of humans here, Who delight in their domain and who are happy and joyful, Who delight in the wealth of sovereignty, Should listen to this lord of the sūtras.

source: མདོ་སྡེའི་དབང་འདི་མཆོག་ཏུ་དགེ་བར་བྱེད། །ཕ་རོལ་དགྲ་ནི་ཡང་དག་ཟད་པར་བྱེད། །ཕ་རོལ་དམག་ཚོགས་ཟློག་བྱེད་དགེ་བ་བྱེད། །
en: “The opposing hordes of enemies will come to an end; This source of goodness will repel enemy armies.

source: མཆོག་ཏུ་འཇིགས་པས་ཕོངས་པ་སེལ་བར་བྱེད། །
en: Ruination through the greatest fear will be averted. This lord of sūtras is the source of goodness.

source: དཔེར་ན་རིན་ཆེན་ཤིང་ལྗོན་རབ་མཛེས་པ། །ཡོན་ཏན་ཀུན་འབྱུང་ཁྱིམ་ན་ཡོད་པ་ལྟར། །རྒྱལ་པོ་ཡོན་ཏན་འདོད་པ་རྣམས་ཀྱིས་ཀྱང་། །མདོ་སྡེའི་དབང་པོའི་མཆོག་འདི་དེ་ལྟར་བལྟ། །
en: “A king who wishes for good qualities Should view this supreme lord of sūtras As being like a beautiful, precious tree That is in the home, and the source of all qualities.

source: དཔེར་ན་ཆུ་གྲང་སྐོམ་པ་སེལ་བྱེད་པ། །ཚ་བས་ཉམ་ཐག་དེ་ནི་རྙེད་པ་ལྟར། །ཡོན་ཏན་དག་གིས་སྐོམ་པའི་རྒྱལ་པོ་ལ། །མདོ་སྡེའི་དབང་པོའི་མཆོག་འདི་དེ་བཞིན་ནོ། །
en: “Just as cool water dispels thirst When found by someone fatigued by heat, That is what this supreme king of sūtras is like For a king who is thirsty for good qualities.

source: དཔེར་ན་རིན་ཆེན་ཐམས་ཅད་འབྱུང་བའི་གནས། །རིན་ཆེན་སྣོད་ནི་ལག་མཐིལ་ཡོད་པ་ལྟར། །མི་ཡི་དབང་པོ་ཚོགས་ལ་གསེར་འོད་མཆོག །མདོ་སྡེའི་དབང་པོའི་མཆོག་འདི་དེ་བཞིན་ནོ། །
en: “Like a precious casket in the hands, Which is a source of every jewel, That is what this supreme king of sūtras, The Golden Light, is for the multitudes of kings.

source: འདི་ནི་ལྷ་ཡི་ཚོགས་ཀྱིས་མངོན་མཆོད་པ། །
en: “The devas make offerings to this lord of sūtras.

source: མདོ་སྡེའི་དབང་པོ་ལྷ་དབང་ཕྱག་བྱས་པས། །
en: The lords of the devas pay homage to it.

source: འཇིག་རྟེན་སྐྱོང་བ་རྫུ་འཕྲུལ་ཆེན་པོ་པ། །བཞི་པོ་དག་གིས་ཀུན་དུ་བསྲུངས་པ་ཡིན། །
en: The four protectors of the world, With great miracles, guard it well.

source: ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་རྟག་ཏུ་དགོངས། །
en: “The buddhas in the ten directions Always think of this lord of sūtras.

source: མདོ་སྡེའི་དབང་པོ་འདི་ནི་བཤད་པ་ན། །སངས་རྒྱས་རྣམས་ཀྱིས་ལེགས་ཞེས་བརྗོད་པ་བྱིན། །
en: Whenever this sūtra is taught, The buddhas express their approval.

source: གནོད་སྦྱིན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་རྣམས་ཀྱིས། །ཕྱོགས་བཅུ་དག་ཏུ་ཡུལ་ཡང་སྲུང་བར་བྱེད། །རབ་ཏུ་དགའ་ཞིང་རབ་ཏུ་མགུ་སེམས་ཀྱིས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་ཉན་པར་བྱེད། །
en: “The million million yakṣas that guard The domains in the ten directions Listen to this lord of sūtras With joyful minds and with delight.

source: འཛམ་བུའི་གླིང་ན་གནས་པར་གྱུར་པ་ཡི། །ལྷ་ཡི་ཚོགས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་པ། །
en: “The hosts of devas that dwell In Jambudvīpa are beyond number.

source: ལྷ་ཚོགས་དེ་དག་ཀུན་ཀྱང་རབ་དགའ་བས། །མདོ་སྡེའི་དབང་པོ་འདི་ནི་ཉན་པར་བྱེད། །
en: Those hosts of devas, with complete joy, Listen to this lord of sūtras.

source: ཆོས་རྣམས་མཉན་པར་བྱ་བ་འདི་ཡིས་ནི། །གཟི་བརྗིད་དང་ནི་སྟོབས་དང་བརྩོན་འགྲུས་ཐོབ། །གཟི་བྱིན་ཆེན་པོ་ཡིས་ནི་ལྷ་ཡི་ལུས། །ཤིན་ཏུ་རྒྱས་ཤིང་རྣམ་པར་འཕེལ་བར་འགྱུར། །
en: “Through the act of listening to this sūtra, They gain magnificence, strength, and diligence, And the magnificence of their divine bodies Vastly increases and expands.”

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་འདི་དག་ཐོས་པ་དང་ངོ་མཚར་དུ་གྱུར། རྨད་དུ་བྱུང་བར་གྱུར། དགའ་བར་གྱུར་ཏེ།
en: The Four Mahārājas, on hearing these verses from the Bhagavat, were astonished, amazed, and overjoyed.

source: དེ་དག་ཆོས་ཀྱི་ཤུགས་ཀྱིས་ཡུད་ཙམ་ཞིག་ཏུ་ངུས་ནས་མཆི་མ་ཕྱིས་ཏེ།
en: Through the power of the Dharma, they briefly wept and shed tears.

source: དེ་དག་ལུས་འཕར་ཡན་ལག་འདར་ཞིང་དགའ་བ་དང་། བདེ་བ་དང་། ཡིད་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་གྱུར་ནས།
en: Their bodies shook and their limbs trembled, and they felt joy, bliss, and happiness.

source: ཡང་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དག་གིས་གཏོར། མངོན་པར་གཏོར་ཏོ། །མངོན་པར་གཏོར་ནས་ཀྱང་སྟན་རྣམས་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: They scattered divine coral tree flowers toward the Bhagavat.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྒྱལ་པོ་ཆེན་པོ་རེ་རེ་ལ་ཡང་གནོད་སྦྱིན་ལྔ་བརྒྱ་ལྔ་བརྒྱ་དང་། ཆོས་སྨྲ་བ་དེ་ལ་བསྲུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བའི་སླད་དུ། རྟག་ཏུ་དགེ་སློང་ཆོས་སྨྲ་བའི་སླད་བཞིན་འབྲང་བར་བགྱིའོ། །
en: When they had scattered them, they rose from their seats, and with their upper robes over one shoulder, knelt on their right knee, and with palms together in homage, bowed toward the Bhagavat and said, “Venerable Bhagavat, we, the Four Mahārājas, each with five hundred yakṣas, will always follow behind the dharmabhāṇaka bhikṣu in order to guard and protect that dharmabhāṇaka.

source: གལ་ཏེ་མདོ་སྡེ་འདི་ལས་ཚིག་གི་དོན་འགའ་ཞིག་བརྗེད་པར་གྱུར་ན་ཡང་། བདག་ཅག་གིས་དེ་ལ་དྲན་པ་དང་། མི་བརྗེད་པའི་མཆོག་གི་གཟུངས་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ། །
en: “If he forgets some of the meanings of the words in this sūtra, we will make his memory a supreme, never-forgetting power of mental retention, with the Dharma teaching complete.

source: མདོ་སྡེའི་དབང་པོ་འདི་དག་གང་ན་བཞུགས་པའི་གནས་དེ་དག་གི་སེམས་ཅན་རྣམས་ཀྱིས་ཡོངས་སུ་རྒྱས་པར་བྱེད་པས། ནམ་ཡང་ནུབ་པར་མི་འགྱུར་རོ། །
en: The beings in those places where these lords of the sūtra reside will prosper and never decline.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་འདུས་པ་དེ་དག་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པའི་ཚེ། སེམས་ཅན་དེ་དག་གིས་ཡེ་ཤེས་དང་། སྤོབས་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཚད་མེད་པ་ཐོབ་པས། ཉོན་མོངས་པ་སྤངས་པའི་བདེ་བ་དང་ལྡན་ཏེ།
en: Then, when the Bhagavat was giving this Dharma teaching to those gathered in that assembly, those beings attained wisdom, eloquence, and an immeasurable accumulation of merit, so that they possessed happiness devoid of defilements.

source: བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་ཤིང་འཁོར་བ་ཡོངས་སུ་སྤངས་ཏེ། བླ་ན་མེད་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: They became wise in all texts, completely rejected saṃsāra, and quickly attained irreversible progress toward enlightenment.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཡུལ་འཁོར་ཡོངས་སུ་སྐྱོང་བའི་ལེའུ་ཞེས་བྱ་སྟེ། བཅུ་གཉིས་པའོ།། །།བམ་པོ་བདུན་པ།
en: This concludes “The Four Mahārājas Protecting the Land,” the twelfth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ། ཆགས་པ་མེད་པའི་གཟུངས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་བསྒོམས་པ་རྣམས་ཀྱི་མ་དང་།
en: Chapter 13: The Dhāraṇī of Nonattachment Then the Bhagavat said to Venerable Śāradvatīputra, “Śāradvatīputra, it is thus: this Dharma teaching called The Dhāraṇī of Nonattachment is the mother of the bodhisattvas who meditate on all phenomena.

source: བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: It is the past practice of bodhisattvas and it is held by the bodhisattvas.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུངས་ནི་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་པ་ལགས་ན། བཅོམ་ལྡན་འདས་གཟུངས་གཟུངས་ཞེས་བགྱི་བའི་གཟུངས་ཀྱི་ཚིག་གི་དོན་དེ་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Venerable Śāradvatīputra asked the Bhagavat, “Bhagavat, if a dhāraṇī is not located in an object and not located in a direction, then, Bhagavat, what is the meaning of the word dhāraṇī?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་ཁྱོད་ཐེག་པ་ཆེན་པོ་ལ་གནས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་མོས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་ཡིན་ན།
en: The Bhagavat replied to Venerable Śāradvatīputra, “Śāradvatīputra, you are within the Mahāyāna, have faith in the Mahāyāna, and are adept in the Mahāyāna.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་ཁྱོད་གཟུངས་ནི་ཡུལ་ན་མི་གནས་ཕྱོགས་ན་མི་གནས་ཤིང་།
en: Śāradvatīputra, it is just you who have taught that a dhāraṇī is not located in an object and not located in a direction.

source: ཆོས་ཀྱང་མ་ཡིན།
en: It is not a phenomenon.

source: ཆོས་མ་ཡིན་པ་ཡང་མ་ཡིན།
en: It is not a nonphenomenon.

source: འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན།
en: It is not past, it is not future, and it is not present.

source: དངོས་པོ་ཅན་ཡང་མ་ཡིན། དངོས་པོ་མེད་པ་ཅན་ཡང་མ་ཡིན།
en: It is not a thing, and it is not nothing.

source: རྐྱེན་ལས་བྱུང་བ་ཡང་མ་ཡིན། རྐྱེན་མེད་པ་ལས་བྱུང་བ་ཡང་མ་ཡིན།
en: It does not originate from a condition, and it does not originate from the absence of a condition.

source: འགྲོ་བ་ལས་བྱུང་བ་ཡང་མ་ཡིན། འགྲོ་བ་མེད་པ་ལས་བྱུང་བ་ཡང་མ་ཡིན།
en: It does not originate from a being, and it does not originate from the absence of a being.

source: ཆོས་གང་གི་སྐྱེ་བ་ཡང་མ་ཡིན། འགོག་པ་ཡང་མ་ཡིན་པར་ཆོས་སྟོན་མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་པར་བྱ་བའི་ཕྱིར། འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་དང་།
en: It is not the production of any phenomenon, and it is not their cessation.

source: སངས་རྒྱས་ཀྱི་བསླབ་པ་དང་། སངས་རྒྱས་ཀྱི་དགོངས་པ་དང་། སངས་རྒྱས་འབྱུང་བ་འདི་ལྟ་སྟེ། ཆགས་པ་མེད་པའི་གཟུངས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་སྒྲུབ་པའི་ལམ་གྱི་རིག་པ་དང་། སྟོབས་ཀྱི་གནས་སྟོན་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Nevertheless, it is excellent, excellent, that, for the benefit of bodhisattvas, there is the teaching on the topic of the knowledge and power of the path of practicing the Dharma teaching of The Dhāraṇī of Nonattachment, which is composed of the qualities of the buddhas, the correct conduct of the buddhas, the training of the buddhas, the intention of the buddhas, and the occurrence of the buddhas.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Venerable Śāradvatīputra said to the Bhagavat, “Bhagavat, I pray that you give the Dharma teaching of the dhāraṇī.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། གཟུངས་ཐོབ་པས་གང་ལ་གནས་ན། བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དང་། ཡང་དག་པར་དམ་བཅས་པར་འགྱུར་བ་དང་། རྟེན་མེད་པའི་ཆོས་ཀྱི་རང་བཞིན་གྱི་སྤོབས་པ་ཅན་གྱི་སློབ་དཔོན་དང་། ལམ་ལ་ཤིན་ཏུ་གནས་པར་འགྱུར་བའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་དུ་གསོལ།
en: A bodhisattva who has obtained the dhāraṇī, wherever they dwell, will be irreversible from the highest, most complete enlightenment; their commitments will be genuine, they will be ācāryas with an eloquence that has the nature of being a nondependent phenomenon, and they will remain perfectly upon the path.

source: བདེ་བར་གཤེགས་པ་བཤད་དུ་གསོལ།
en: I pray for the Sugata to teach it.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: The Bhagavat said to Śāradvatīputra, “Excellent, excellent, Śāradvatīputra!

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སངས་རྒྱས་ཉིད་དུ་བརྗོད་པར་བྱ་སྟེ།
en: It is so. The bodhisattva who has obtained this dhāraṇī should be called a buddha.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་ལ་གཟུངས་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་བཀུར་སྟིར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། རིམ་གྲོར་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དེས་སངས་རྒྱས་ལ་བཀུར་སྟིར་བྱས་པར་འགྱུར་རོ། །
en: Śāradvatīputra, whoever honors, venerates, serves, and makes offerings to a bodhisattva who has obtained this dhāraṇī will be someone who has honored a buddha.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་ལ་གཟུངས་འདི་ཉན་པར་བྱེད་པ་དང་། གང་དག་གཟུངས་འདི་འཆང་བར་བྱེད་པ་དང་། གང་དག་མོས་པར་བྱེད་པ་དེ་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་སེམས་དང་མ་བྲལ་བས། སངས་རྒྱས་ལ་ཇི་ལྟར་མཆོད་པ་དེ་བཞིན་དུ་འགྱུར་རོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཟུངས་དེ་ནི་འདི་ཡིན་ཏེ་ཏདྱ་ཐཱ། སན་དྷཱ་ར་ཎི། ཨུཏ་དྷཱ་ར་ཎི། སུ་སཾ་པྲ་ཏིཥྛི་ཏེ། སུ་ནཱ་མ། སུ་པྲ་ཏིཥྛི་ཏེ། བི་ཛ་ཡ་བ་ལ། སཏྟྱ་པྲ་ཏི་ཛྙཱ། སུ་ཨཱ་རོ་ཧ། ཛྙཱ་ན་པྲ་ཏི། ཨུཏྤཱ་ད་ནི། ཨ་བ་ནཱ་བ་ནི། ཨ་བྷི་ཥིཉྩ་ནི། ཨ་བྷི་བྱ་ཧཱ་ར།
en: “Śāradvatīputra, anyone who hears this dhāraṇī, anyone who possesses this dhāraṇī, and anyone who aspires to this dhāraṇī will become inseparable from the enlightenment mind, the same as if they had made offerings to a buddha.

source: ཤུ་བྷ་བ་ཏི། སུ་ནིཿཤྲི་ཏ། བ་ཧུ་གུཾ་བྷ། ཨ་བྷི་བ་དཱ་སྭཱ་ཧཱ། ཤ་ར་དྭ་ཏིའི་བུ་ཆགས་པ་མེད་པའི་གཟུངས་ཀྱི་ཚིག་འདི་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཤིན་ཏུ་གནས་པ་དང་། ལེགས་པར་གཟུང་བ་བྱས་ནས། འཆང་བར་བྱེད་པ་དེ་བསྐལ་པའམ།
en: “Śāradvatīputra, this is the dhāraṇī: tadyathā | sandhāraṇi utdhāraṇi susaṃpratiṣṭhite sunāma supratiṣṭhite vijayabala, sattyapratijñā suāroha jñānapratiutpādani avanāvani abhiṣiñcani abhivyāhāra śubhavati suniḥśrita bahuguṃbha abhivadā svāhā | “Śāradvatīputra, any bodhisattva who is firmly established in the words of this dhāraṇī of nonattachment perfectly retains them and possesses them, and so their prayer will not be exhausted for an eon, for longer than an eon, for a thousand eons, or for a hundred thousand eons.

source: བསྐལ་པ་ལས་ལྷག་པའམ། བསྐལ་པ་སྟོང་ངམ། བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་དུ་ཡང་སྨོན་ལམ་ཟད་པར་མི་འགྱུར་ལ། དེའི་ལུས་ལ་མཚོན་གྱིས་ཚུགས་པར་མི་འགྱུར་ཏེ། དུག་གིས་མ་ཡིན་ཞིང་སྦྲུལ་གྱིས་ཚུགས་པར་མི་འགྱུར་རོ། །
en: Their body will not be harmed by weapons or poisons, and they will not be bitten by snakes.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་ཆགས་པ་མེད་པའི་གཟུངས་འདི་ནི།
en: “Why is that?

source: འདས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ། མ་བྱོན་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ་སྟེ། འདི་ལྟ་སྟེ། ཆགས་པ་མེད་པའི་གཟུངས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡིན་ནོ། །
en: Śāradvatīputra, it is because this unbounded dhāraṇī is the mother of the buddhas of the past, the mother of the buddhas of the future, and the mother of the buddhas of the present, and that is this Dharma teaching called The Dhāraṇī of Nonattachment.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་ཕྲག་བཅུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཡོན་དུ་ཕུལ་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་རྣམས་ལ་བསྐལ་པ་གྲངས་མེད་པར་ན་བཟའ་དང་། ཞལ་ཟས་གྱ་ནོམ་པས་བཞུགས་པར་བྱེད་པ་བས། གང་དག་གིས་ཆགས་པ་མེད་པའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཚིག་གཅིག་ཙམ་འཛིན་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་དེ་བས་ཆེས་བསོད་ནམས་མང་དུ་སྐྱེད་པར་འགྱུར་རོ། །
en: “Śāradvatīputra, if someone were to fill ten asaṃkhyeya trichiliocosm world realms with the seven jewels and make an offering of them to the buddha bhagavats, and if they were to provide the requisites of clothing and food of various kinds for asaṃkhyeya eons, the merit that comes from someone who possesses just one word of this dhāraṇī would still be far greater.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་ཆགས་པ་མེད་པའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུམ་ཡིན་ནོ། །
en: Śāradvatīputra, it is because this Dharma teaching of the unbounded dhāraṇī is the mother of the tathāgatas.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས་ཆགས་པ་མེད་པའི་གཟུངས་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: This concludes “The Dhāraṇī of Nonattachment,” the thirteenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་གློག་ཐམས་ཅད་ཟློག་པ། སོ་སོར་འབྲང་བ་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པ།
en: Chapter 14: The Wish-fulfilling Jewel Dhāraṇī Then the Bhagavat, in the midst of the great assembly, said to Venerable Ānanda, “Ānanda, there is that which repels all lightning, which has been taught by the samyaksaṃbuddhas of the past.

source: ང་ཡང་ད་ལྟར་འཆད་ཀྱིས་ཟུང་ཤིག །
en: Following them, I also will now teach it, so you should retain it!

source: ཀུན་དགའ་བོ་ཤར་ཕྱོགས་ན་འོང་བ་ཞེས་བྱ་བའི་གློག་ཡོད། ཀུན་དགའ་བོ་ལྷོ་ཕྱོགས་ན་སྐད་བརྒྱ་པ་ཞེས་བྱ་བའི་གློག་ཡོད། ཀུན་དགའ་བོ་ནུབ་ཕྱོགས་ན་འོད་ཉམས་པ་ཞེས་བྱ་བའི་གློག་ཡོད། ཀུན་དགའ་བོ་བྱང་ཕྱོགས་ན་རྒྱུན་གྱི་བདག་པོ་ཞེས་བྱ་བའི་གློག་ཡོད་དེ།
en: “Ānanda, to the east there is the lightning called Āgata, to the south there is the lightning called Hundredth Moment, to the west there is the lightning called Waning Light, and to the north there is the lightning called Satamapati.

source: ཀུན་དགའ་བོ་གང་ལ་ལ་གློག་འདི་རྣམས་ཀྱི་མིང་ཤེས་པ་དང་། ཕྱོགས་རྣམ་པར་གནས་པ་ཤེས་པ་དེ་ལ་གློག་གི་འཇིགས་པ་ཐམས་ཅད་མི་འབྱུང་བར་ཤེས་པར་བྱའོ། །
en: “Ānanda, someone who knows the name of each lightning and knows the direction where it is situated will know that all danger from lightning will not occur.

source: གློག་གི་མིང་འདི་དག་ཡི་གེར་བྲིས་ཏེ། གནས་གང་དུ་བཞག་པའི་གནས་དེ་དག་ཏུ། གློག་ཐམས་ཅད་མི་འབབ་བོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ། དྲཱ་བི་ཌའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: When they write down the names of the lightning, wherever they dwell there will be no lightning that strikes.”

source: ཏདྱ་ཐཱ། ནི་མི་ནི་མི། ནི་མིན་དྷ་རི། འཇིག་རྟེན་གསུམ་སྣང་བར་བྱེད་པ། ལག་ན་རྩེ་གསུམ་པས་ཕྱོགས་འདིར་གློག་ཐམས་ཅད་ལས་བདག་ལ་སྲུངས་ཤིག་སྲུངས་ཤིག་སྭཱ་ཧཱ།
en: Then, at that time, the Bhagavat recited these words of a Dravidian mantra: tadyathā | nimi nimi nimindhari, illuminator of the three worlds who holds a trident in his hands, protect me, protect me from all lightning in this place!

source: ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ། འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ། དྲཱ་བི་ཌའི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་བརྗོད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཀ་ཊེ་བི་ཀ་ཊེ། ནི་ཀ་ཊེ། པྲ་ཏྱ་རྠི་ཀེ །
en: svāhā | Also at that time, the bodhisattva mahāsattva Avalokiteśvara was present in that assembly.

source: པྲཏྱ་མི་ཏྲེ། ཤུདྡྷེ། མུཀྟེ། བི་མ་ལེ། པྲ་བྷཱ་སྭ་རེ། ཨཎྜ་རེ། པཎྜ་རེ། ཤྭེ་ཏེ། པཎྜ་ར་བཱ་སི་ནི།
en: Being present, he said to the Bhagavat, “Bhagavat, I also, for this Dharma teaching, will recite the words of a Dravidian mantra: tadyathā | kate vikate nikate pratyarthike pratyamitre śuddhe mukte vimale prabhāsvare aṇḍare paṇḍare śvete paṇḍaravāsini harikaṇḍari piṃgala akṣi dadhi mukhi.

source: ཧ་རི་ཀཎྜ་རི། ཀ་པི་ལི། པིཾ་ག་ལ། ཨཀྵི་ད་དྷི་མུ་ཁི། དུས་མ་ཡིན་པར་འཆི་བ་ཐམས་ཅད་ལས་བདག་ལ་སྲུངས་ཤིག་སྲུངས་ཤིག །
en: Protect me, protect me from all premature death.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟི་བརྗིད་ཀྱིས། བདག་དུས་མ་ཡིན་པར་འཆི་བ་ཐམས་ཅད་མཐོང་བར་མ་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: Through the magnificence of Ārya Avalokiteśvara may I never see any premature death!

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གཟུངས་ཀྱི་ཚིག་རྣམས་བརྗོད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། མུ་ནི་མུ་ནི། མུ་ནི་ན་དྷ་རི་མུ་ནི།
en: svāhā | Then Vajrapāṇi, the lord of secrets, placed his palms together, bowed toward the Bhagavat, and said to the Bhagavat, “Bhagavat, I also will recite the words of a dhāraṇī for this Dharma teaching: tadyathā | muni muni muni nadhari muni mati mati sumati mahāmati hā hā hā hā.

source: མ་ཏི་མ་ཏི། སུ་མ་ཏི། མ་ཧཱ་མ་ཏི། ཧཱ་ཧཱ་ཧཱ་ཧཱ། ཁྱོད་ལ་སྡིག་པ་མེད་ཀྱིས་མ་འཇིགས་ཤིག་ཅེས་ལག་ན་རྡོ་རྗེས་སྨྲས་ཀྱིས་དྲཱ་བི་ཌ་སྭཱ་ཧཱ།
en: Vajrapāṇi has said, ‘You have no bad karma, so do not be afraid!’

source: བཅོམ་ལྡན་འདས་བདག་གི་བསྲུང་བ་གཞན་གྱིས་མི་ཐུབ་པ་འདི་སུའི་སྙིང་ལ་འཛིན་ཏམ། ཡི་གེར་བྲིས་པ་དེ་བདག་གིས་རྟག་པར་རྒྱུན་དུ། འཇིགས་པ་ཐམས་ཅད་ལས་བསྲུང་བར་བགྱིའོ། །དུས་མ་ལགས་པར་འགུམ་པ་ཐམས་ཅད་ལས་ཐར་བར་བགྱིའོ། །དེ་ནས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: svāhā | “Bhagavat, whoever keeps in their heart this invincible protection of mine, or writes it out, will always be continually protected from all danger.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་བསྐྱེད་པའི་སླད་དུ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ། གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་བརྗོད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཧི་ལི་མི་ལི། ཙི་ལི་སྭཱ་ཧཱ།
en: I will save them from all premature death.”

source: བྲཧྨ་པཱུ་རེ་སྭཱ་ཧཱ། བྲཧྨ་སྭ་རེ་སྭཱ་ཧཱ། བྲཧྨ་བྷི་སུ་གརྦྷེ། པུཥྤ་སཾ་སྟ་རེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གི་བསྲུང་བ་ཚངས་པའི་ཆད་པ་ཞེས་བགྱི་སྟེ། དུས་མ་ལགས་པར་འགུམ་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་སྐྱོབ་པ། སྡིག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ་ལགས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་བརྗོད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ནི་བ་རཱ་ཎི། བནྡྷ་མཱ་རནྟེ་མ་ཏི་ཏི། ཏི་ཏི། གཽ་རཱི། གནྡྷ་རི། ཙཎྜཱ་ལི། མཱ་ཏངྒི། པ་རྞ་ལེ། ཧི་ན་མ་དྷྱ་མ་དྷ་རི་ཎི་མ་ལ་ནི། ད་ལ་མད་དེ། ཙཀྲ་བཱ་ཀྲཱི།
en: Then Mahābrahmā, the lord of Sahā, said to the Bhagavat, “Bhagavat, I also, for the welfare, benefit, and happiness of beings, will recite the words of a mantra for this Dharma teaching: tadyathā | hili mili cili svāhā brahmapūre svāha brahmasvare svāha brahmabhisugarbhe puṣpasaṃstare svāhā | “Bhagavat, this protection of mine is called Brahmā’s punishment, and it will protect from all premature death and bring to an end all bad karma.”

source: ཤ་བ་རི། ཤ་བ་རི་སྭཱ་ཧཱ། བཙུན་པ་བཅོམ་ལྡན་འདས་འདི་ནི་བདག་གི་རིག་སྔགས་རྡོ་རྗེའི་ལྕེ་འབེབས་པ་ཞེས་བགྱི་སྟེ། འཇིགས་པ་ཐམས་ཅད་ལས་ཐར་བར་བགྱིད་པ། དུས་མ་ལགས་པར་འགུམ་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་སྐྱོབ་པ་ལགས་སོ། །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྲུང་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Śakra, the lord of devas, with his palms together, bowed toward the Bhagavat and said to the Bhagavat, “Bhagavat, I also will recite the words of a dhāraṇī-mantra for this Dharma teaching: tadyathā | nivarāni banddha mādantema titi titi gaurī gandhari caṇḍāli mātaṅgi parṇale hinamadhyamadhariṇi malani dalamdade cakrāvākrī śavari savari svāhā | “Venerable Bhagavat, this vidyāmantra of mine, which is called hurled-down vajra flames, frees from all dangers, all fear and terror, and protects from all premature death.”
